app/controllers/songs_controller.rb

SELECT  "songs".* FROM "songs" LIMIT 20 OFFSET 0
SELECT COUNT(*) FROM (SELECT  1 AS one FROM "songs" LIMIT ? OFFSET ?) subquery_for_count  [["LIMIT", 10], ["OFFSET", 0]]
---
  def index
    @songs = Song.page(params[:page])